jmeter-load-test-sas-detection-with-testkube.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="load-test-sas-detection" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="SendTransactions" enabled="true">
        <stringProp name="TestPlan.comments">Send Transactions to sas-detection</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">4</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request Send Transaction" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(detectionServiceName)}</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/detection/decision/execute</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">Send a transaction to sas-detection</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
            <stringProp name="TestPlan.comments"> Randomize Acct and Card numbers</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def body =&apos;{SMH:{smh_msg_version:&quot;06.01.00&quot;,smh_tran_type:&quot;TRX&quot;,smh_schema:&quot;Cards&quot;,smh_cust_type:&quot;I&quot;,smh_acct_type:&quot;CC&quot;,smh_authenticate_mtd:&quot;CD&quot;,smh_channel_type:&quot;C&quot;,smh_activity_type:&quot;CA&quot;,smh_activity_detail1:&quot;DMX&quot;,smh_activity_detail2:&quot;DUA&quot;,smh_activity_detail3:&quot;NAP&quot;,smh_client_tran_type:&quot;1829202174&quot;,smh_priority:&quot;1&quot;,smh_resp_req:&quot;1&quot;,smh_sdd_ind:&quot;1&quot;,smh_source:&quot;Eclipse&quot;,smh_dest:&quot;TEST&quot;,smh_multi_org_name:&quot;AF_PC_CR&quot;},RRR:{rrr_service:&quot;0110&quot;,rrr_action_info:&quot;6000&quot;},RQO:{rqo_tran_date:2022-06-11,rqo_tran_time:0001-01-01T15:30:10.0Z,rqo_tran_utc_flag:&quot;N&quot;,rqo_tran_date_alt:2022-06-11,rqo_tran_time_alt:0001-01-01T15:30:10.0Z,rqo_tran_date_client:2022-06-11,rqo_tran_time_client:0001-01-01T15:30:10.0Z},XQO:{xqo_cust_num:&quot;123456789&quot;,xqo_cust_rand_dig:0,xqo_sas_cust_rand_dig:0,xqo_cust_type:&quot;B&quot;},AQO:{aqo_acct_num:&quot;myacctnum&quot;,aqo_branch_id:&quot;581107008&quot;,aqo_acct_post_code:&quot;01841&quot;,aqo_acct_cntry_code:&quot;840&quot;,aqo_port_hier_1:&quot;DUAL&quot;,aqo_port_hier_2:&quot;CONS&quot;},AQC:{},UCM:{ucm_card_present:&quot;0&quot;,ucm_term_pan_entry_cap:&quot;0&quot;,ucm_pos:&quot;00&quot;,ucm_cust_present:&quot;0&quot;,ucm_msg_exp_date:2022-06-11,ucm_scheme:&quot;9&quot;},HQO:{hqo_card_num:&quot;mycardnum&quot;,hqo_entity_use_card:&quot;H&quot;,hqo_pb_userid:&quot;123123&quot;,hqo_limit_amt:9900000e0,hqo_msg_type:&quot;card&quot;},HCT:{hct_card_purpose:&quot;M&quot;,hct_ch_post_code:&quot;1&quot;,hct_ch_cntry_code:&quot;840&quot;,hct_media:&quot;0&quot;,hct_which_card:&quot;1&quot;,hct_onus_flag:&quot;1&quot;,hct_xmit_datetime:&quot;20220611153010&quot;,hct_term_owner_id:&quot;1&quot;,hct_mer_mcc:&quot;6011&quot;,hct_term_id:&quot;1&quot;,hct_term_owner_name:&quot;IamHctTermOwnerName&quot;,hct_term_city:&quot;San Diego&quot;,hct_term_state:&quot;CA&quot;,hct_term_cntry_code:&quot;840&quot;,hct_term_owner_name_lcl:&quot;San LCL&quot;,hct_acq_id:&quot;12345678910&quot;},TCA:{tca_merch_amt:4.2e0,tca_merch_curr_code:&quot;764&quot;,tca_client_amt:4.2e0,tca_client_curr_code:&quot;764&quot;,tca_mod_amt:4.2e0,tca_client_tran_type:&quot;10&quot;,tca_auth_sys_dec:&quot;1&quot;,tca_auth_sys_info:&quot;6000&quot;,tca_reversal_ind:&quot;N&quot;},DMX:{dmx_n3_01:31,dmx_n3_03:33,dmx_n8_01:81,dmx_n8_02:82,dmx_n8_03:83,dmx_n22_01_tag:&quot;22&quot;,dmx_n22_01:10e0,dmx_n22_02:0e0,dmx_3byte_string_02:&quot;RDB&quot;,dmx_5byte_string_01_tag:&quot;MT&quot;,dmx_5byte_string_01:&quot;99999&quot;,dmx_10byte_string_01:&quot;dmx10_01&quot;},RUR:{rur_numeric_001:45.01e0,rur_numeric_002:0e0,rur_8byte_string_002:&quot;rur8_002&quot;}}&apos;

Integer randomNum = Math.abs(new Random().nextInt() % 1000) + 1
body = body.replaceAll(&apos;myacctnum&apos;, &quot;000000000000&quot; + randomNum.toString())
body = body.replaceAll(&apos;mycardnum&apos;, &quot;000000000000&quot; + randomNum.toString())
sampler.getArguments().removeAllArguments()
sampler.addNonEncodedArgument(&apos;&apos;,body,&apos;&apos;)
sampler.setPostBodyRaw(true)
</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>